apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_memorymap.h
/****************************************************************************
 * arch/arm/src/imxrt/hardware/rt117x/imxrt117x_memorymap.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_MEMORYMAP_H
#define __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_MEMORYMAP_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* System Memory Map ********************************************************/

#define IMXRT_ITCM_BASE            (0x00000000) /* 512 KB, CM7: ITCM (FlexRAM) */

/*                                 (0x00080000)    512 KB, Reserved
 *                                 (0x00100000)      1 MB, Reserved
 *                                 (0x00200000)    256 KB, Reserved
 *                                 (0x00240000)    256 KB, Reserved
 */

#define IMXRT_CAAM_BASE            (0x00280000) /*  64 KB, CAAM Secure RAM */

/*                                 (0x00290000)   1472 KB, Reserved
 *                                 (0x00400000)    124 MB, Reserved
 */

#define IMXRT_FLEXSPI1_ALIAS_BASE  (0x08000000) /* 256 MB, CM4: FlexSPI1 (alias) */

                                /* (0x18000000)    128 MB, Reserved */

#define IMXRT_CODE_TCM_BASE        (0x1ffe0000) /* 128 KB, CM4: Code TCM (LMEM RAM_L) */
#define IMXRT_SYSTEM_TCM_BASE      (0x20000000) /* 128 KB, CM4: System TCM (LMEM RAM_U) */
#define IMXRT_DTCM_BASE            (0x20000000) /* 512 KB, CM7: DTCM (FlexRAM) */

/*                                 (0x20080000)    512 KB, Reserved
 *                                 (0x20100000)      1 MB, Reserved
 */

#define IMXRT_OCRAM_M4_BASE        (0x20200000) /* 256 KB, OCRAM M4 (LMEM 128 KB SRAM_L + 128 KB SRAM_U backdoor) */
#define IMXRT_OCRAM_BASE           (0x20240000) /* 512 KB, OCRAM1 */
#define IMXRT_OCRAM2_BASE          (0x202c0000) /* 512 KB, OCRAM2 */
#define IMXRT_OCRAM1_ECC_BASE      (0x20340000) /*  64 KB, OCRAM1 ECC */
#define IMXRT_OCRAM2_ECC_BASE      (0x20350000) /*  64 KB, OCRAM2 ECC */
#define IMXRT_OCRAM_M7_BASE        (0x20360000) /* 128 KB, OCRAM M7 (FlexRAM) */
#define IMXRT_OCRAM_M7_ECC_BASE    (0x20380000) /* 512 KB, OCRAM M7 (FlexRAM ECC) */

                                /* (0x20400000)    244 MB, Reserved */

#define IMXRT_FLEXSPI1_TX_BASE     (0x2f800000) /*   4 MB, FlexSPI1 TX FIFO */
#define IMXRT_FLEXSPI1_RX_BASE     (0x2fc00000) /*   4 MB, FlexSPI1 RX FIFO */
#define IMXRT_FLEXSPI1_CIPHER_BASE (0x30000000) /* 256 MB, FlexSPI1 / FlexSPI1 cipher text */
#define IMXRT_AIPS1_BASE           (0x40000000) /*   4 MB, AIPS-1 */
#define IMXRT_AIPS2_BASE           (0x40400000) /*   4 MB, AIPS-2 */
#define IMXRT_AIPS3_BASE           (0x40800000) /*   4 MB, AIPS-3 */
#define IMXRT_AIPS4_BASE           (0x40c00000) /*   4 MB, AIPS-4 */
#define IMXRT_SIM_DISP_BASE        (0x41000000) /*   1 MB, SIM_DISP configuration port */
#define IMXRT_SIM_M_BASE           (0x41100000) /*   1 MB, SIM_M configuration port */

/*                                 (0x41200000)      1 MB, Reserved
 *                                 (0x41300000)      1 MB, Reserved
 */

#define IMXRT_SIM_M7_BASE          (0x41400000) /*   1 MB, SIM_M7 configuration port */

/*                                 (0x41500000)      1 MB, Reserved
 *                                 (0x41600000)      1 MB, Reserved
 *                                 (0x41700000)      1 MB, Reserved
 */

#define IMXRT_GPU2D_BASE           (0x41800000) /*   1 MB, GPU2D (Peripheral, AHB) */
#define IMXRT_CDOG_BASE            (0x41900000) /*   1 MB, CDOG (Peripheral, AHB) */

                                /* (0x41a00000)      6 MB, Reserved */

#define IMXRT_AIPS_M7_BASE         (0x42000000) /*   1 MB, CM7: AIPS M7 (Peripheral, Platform) */

/*                                 (0x42100000)      7 MB, Reserved
 *                                 (0x42800000)    472 MB, Reserved
 */

#define IMXRT_FLEXSPI2_CIPHER_BASE (0x60000000) /* 504 MB, FlexSPI2 / FlexSPI2 cipher text */
#define IMXRT_FLEXSPI2_TX_BASE     (0x7f800000) /*   4 MB, FlexSPI2 TX FIFO */
#define IMXRT_FLEXSPI2_RX_BASE     (0x7fc00000) /*   4 MB, FlexSPI2 RX FIFO */
#define IMXRT_SEMC0_BASE           (0x80000000) /* 256 MB, SEMC0 */
#define IMXRT_SEMC1_BASE           (0x90000000) /* 256 MB, SEMC1 */
#define IMXRT_SEMC2_BASE           (0xa0000000) /* 512 MB, SEMC2 */
#define IMXRT_SEMC3_BASE           (0xc0000000) /* 512 MB, SEMC3 */
#define IMXRT_PPB_M7_BASE          (0xe0000000) /*   1 MB, CM7: PPB M7 */
#define IMXRT_PPB_M4_BASE          (0xe0000000) /*   1 MB, CM4: PPB M4 */

                                /* (0xe0100000)    511 MB, Reserved */

/* AIPS-1 Memory Map ********************************************************/

/*                                 (0x40000000)     16 KB, Reserved
 *                                 (0x40004000)     16 KB, Reserved
 *                                 (0x40008000)     16 KB, Reserved
 *                                 (0x4000c000)     16 KB, Reserved
 *                                 (0x40010000)     16 KB, Reserved
 */

#define IMXRT_MECC1_BASE           (0x40014000) /*  16 KB, MECC1 */
#define IMXRT_MECC2_BASE           (0x40018000) /*  16 KB, MECC2 */
#define IMXRT_XECC_FLEXSPI1_BASE   (0x4001c000) /*  16 KB, XECC_FLEXSPI1 */
#define IMXRT_XECC_FLEXSPI2_BASE   (0x40020000) /*  16 KB, XECC_FLEXSPI2 */
#define IMXRT_XECC_SEMC            (0x40024000) /*  16 KB, XECC_SEMC */
#define IMXRT_CM7_FLEXRAM_BASE     (0x40028000) /*  16 KB, CM7 (FLEXRAM) */
#define IMXRT_EWM_BASE             (0x4002c000) /*  16 KB, EWM */
#define IMXRT_WDOG1_BASE           (0x40030000) /*  16 KB, WDOG1 */
#define IMXRT_WDOG2_BASE           (0x40034000) /*  16 KB, WDOG2 */
#define IMXRT_WDOG3_BASE           (0x40038000) /*  16 KB, WDOG3 */
#define IMXRT_XBAR1_BASE           (0x4003c000) /*  16 KB, XBAR1 */
#define IMXRT_XBAR2_BASE           (0x40040000) /*  16 KB, XBAR2 */
#define IMXRT_XBAR3_BASE           (0x40044000) /*  16 KB, XBAR3 */
#define IMXRT_ADC_ETC_BASE         (0x40048000) /*  16 KB, ADC_ETC */

                                /* (0x4004c000)     16 KB, Reserved */

#define IMXRT_LPADC1_BASE          (0x40050000) /*  16 KB, LPADC1 */
#define IMXRT_LPADC2_BASE          (0x40054000) /*  16 KB, LPADC2 */

/*                                 (0x40058000)     16 KB, Reserved
 *                                 (0x4005c000)     16 KB, Reserved
 *                                 (0x40060000)     16 KB, Reserved
 */

