apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_memorymap.h
#define IMXRT_DAC_BASE             (0x40064000) /*  16 KB, DAC */
#define IMXRT_IEE_APC_BASE         (0x40068000) /*  16 KB, IEE_APC */
#define IMXRT_IEE_BASE             (0x4006c000) /*  16 KB, IEE */
#define IMXRT_EDMA_BASE            (0x40070000) /*  16 KB, EDMA */
#define IMXRT_DMAMUX0_BASE         (0x40074000) /*  16 KB, DMAMUX0 */

                                /* (0x40078000)     16 KB, Reserved */

#define IMXRT_LPUART1_BASE         (0x4007c000) /*  16 KB, LPUART1 */
#define IMXRT_LPUART2_BASE         (0x40080000) /*  16 KB, LPUART2 */
#define IMXRT_LPUART3_BASE         (0x40084000) /*  16 KB, LPUART3 */
#define IMXRT_LPUART4_BASE         (0x40088000) /*  16 KB, LPUART4 */
#define IMXRT_LPUART5_BASE         (0x4008c000) /*  16 KB, LPUART5 */
#define IMXRT_LPUART6_BASE         (0x40090000) /*  16 KB, LPUART6 */
#define IMXRT_LPUART7_BASE         (0x40094000) /*  16 KB, LPUART7 */
#define IMXRT_LPUART8_BASE         (0x40098000) /*  16 KB, LPUART8 */
#define IMXRT_LPUART9_BASE         (0x4009c000) /*  16 KB, LPUART9 */
#define IMXRT_LPUART10_BASE        (0x400a0000) /*  16 KB, LPUART10 */

/*                                 (0x400a4000)     16 KB, Reserved
 *                                 (0x400a8000)     16 KB, Reserved
 */

#define IMXRT_FLEXIO1_BASE         (0x400ac000) /*  16 KB, FlexIO1 */
#define IMXRT_FLEXIO2_BASE         (0x400b0000) /*  16 KB, FlexIO2 */

                                /* (0x400b4000)     16 KB, Reserved */

#define IMXRT_AOI1_BASE            (0x400b8000) /*  16 KB, AOI1 */
#define IMXRT_AOI2_BASE            (0x400bc000) /*  16 KB, AOI2 */

                                /* (0x400c0000)     16 KB, Reserved */

#define IMXRT_CAN1_BASE            (0x400c4000) /*  16 KB, CAN1 */
#define IMXRT_CAN2_BASE            (0x400c8000) /*  16 KB, CAN2 */
#define IMXRT_FLEXSPIC_BASE        (0x400cc000) /*  16 KB, FlexSPI1 */
#define IMXRT_FLEXSPI2C_BASE       (0x400d0000) /*  16 KB, FlexSPI2 */
#define IMXRT_SEMC_BASE            (0x400d4000) /*  16 KB, SEMC */
#define IMXRT_PIT1_BASE            (0x400d8000) /*  16 KB, PIT1 */

                                /* (0x400dc000)     16 KB, Reserved */

#define IMXRT_KPP_BASE             (0x400e0000) /*  16 KB, KPP */
#define IMXRT_IOMUXCGPR_BASE       (0x400e4000) /*  16 KB, IOMUXC_GPR */
#define IMXRT_IOMUXC_BASE          (0x400e8000) /*  16 KB, IOMUXC */
#define IMXRT_GPT1_BASE            (0x400ec000) /*  16 KB, GPT1 */
#define IMXRT_GPT2_BASE            (0x400f0000) /*  16 KB, GPT2 */
#define IMXRT_GPT3_BASE            (0x400f4000) /*  16 KB, GPT3 */
#define IMXRT_GPT4_BASE            (0x400f8000) /*  16 KB, GPT4 */
#define IMXRT_GPT5_BASE            (0x400fc000) /*  16 KB, GPT5 */
#define IMXRT_GPT6_BASE            (0x40100000) /*  16 KB, GPT6 */
#define IMXRT_LPI2C1_BASE          (0x40104000) /*  16 KB, LPI2C1 */
#define IMXRT_LPI2C2_BASE          (0x40108000) /*  16 KB, LPI2C2 */
#define IMXRT_LPI2C3_BASE          (0x4010c000) /*  16 KB, LPI2C3 */
#define IMXRT_LPI2C4_BASE          (0x40110000) /*  16 KB, LPI2C4 */
#define IMXRT_LPSPI1_BASE          (0x40114000) /*  16 KB, LPSPI1 */
#define IMXRT_LPSPI2_BASE          (0x40118000) /*  16 KB, LPSPI2 */
#define IMXRT_LPSPI3_BASE          (0x4011c000) /*  16 KB, LPSPI3 */
#define IMXRT_LPSPI4_BASE          (0x40120000) /*  16 KB, LPSPI4 */

/*                                 (0x40124000)     16 KB, Reserved
 *                                 (0x40128000)     16 KB, Reserved
 */

#define IMXRT_GPIO1_BASE           (0x4012c000) /*  16 KB, GPIO1 */
#define IMXRT_GPIO2_BASE           (0x40130000) /*  16 KB, GPIO2 */
#define IMXRT_GPIO3_BASE           (0x40134000) /*  16 KB, GPIO3 */
#define IMXRT_GPIO4_BASE           (0x40138000) /*  16 KB, GPIO4 */
#define IMXRT_GPIO5_BASE           (0x4013c000) /*  16 KB, GPIO5 */
#define IMXRT_GPIO6_BASE           (0x40140000) /*  16 KB, GPIO6 */

/*                                 (0x40144000)     16 KB, Reserved
 *                                 (0x40148000)     16 KB, Reserved
 *                                 (0x4014c000)     16 KB, Reserved
 *                                 (0x40150000)     16 KB, Reserved
 */

#define IMXRT_EMVSIM1_BASE         (0x40154000) /*  16 KB, EMVSIM1 */
#define IMXRT_EMVSIM2_BASE         (0x40158000) /*  16 KB, EMVSIM2 */
#define IMXRT_TMR1_BASE            (0x4015c000) /*  16 KB, TMR1 */
#define IMXRT_TMR2_BASE            (0x40160000) /*  16 KB, TMR2 */
#define IMXRT_TMR3_BASE            (0x40164000) /*  16 KB, TMR3 */
#define IMXRT_TMR4_BASE            (0x40168000) /*  16 KB, TMR4 */

/*                                 (0x4016c000)     16 KB, Reserved
 *                                 (0x40170000)     16 KB, Reserved
 */

#define IMXRT_QDC1_BASE            (0x40174000) /*  16 KB, QDC1 */
#define IMXRT_QDC2_BASE            (0x40178000) /*  16 KB, QDC2 */
#define IMXRT_QDC3_BASE            (0x4017c000) /*  16 KB, QDC3 */
#define IMXRT_QDC4_BASE            (0x40180000) /*  16 KB, QDC4 */

/*                                 (0x40184000)     16 KB, Reserved
 *                                 (0x40188000)     16 KB, Reserved
 */

#define IMXRT_FLEXPWM1_BASE        (0x4018c000) /*  16 KB, FLEXPWM1 */
#define IMXRT_FLEXPWM2_BASE        (0x40190000) /*  16 KB, FLEXPWM2 */
#define IMXRT_FLEXPWM3_BASE        (0x40194000) /*  16 KB, FLEXPWM3 */
#define IMXRT_FLEXPWM4_BASE        (0x40198000) /*  16 KB, FLEXPWM4 */

/*                                 (0x4019c000)     16 KB, Reserved
 *                                 (0x401a0000)     16 KB, Reserved
 */

#define IMXRT_ACMP1_BASE           (0x401a4000) /*  16 KB, ACMP1 */
#define IMXRT_ACMP2_BASE           (0x401a8000) /*  16 KB, ACMP2 */
#define IMXRT_ACMP3_BASE           (0x401ac000) /*  16 KB, ACMP3 */
#define IMXRT_ACMP4_BASE           (0x401b0000) /*  16 KB, ACMP4 */

/*                                 (0x401b4000)     16 KB, Reserved
 *                                 (0x401b8000)     16 KB, Reserved
 *                                 (0x401bc000)     16 KB, Reserved
 *                                 (0x401c0000)     16 KB, Reserved
 *                                 (0x401c4000)     16 KB, Reserved
 *                                 (0x401c8000)     16 KB, Reserved
 *                                 (0x401cc000)     16 KB, Reserved
 *                                 (0x401d0000)     16 KB, Reserved
 *                                 (0x401d4000)     16 KB, Reserved
 *                                 (0x401d8000)     16 KB, Reserved
 *                                 (0x401dc000)     16 KB, Reserved
 *                                 (0x401e0000)     16 KB, Reserved
 *                                 (0x401e4000)     16 KB, Reserved
 *                                 (0x401e8000)     16 KB, Reserved
 *                                 (0x401ec000)     16 KB, Reserved
 *                                 (0x401f0000)     16 KB, Reserved
 *                                 (0x401f4000)     16 KB, Reserved
 *                                 (0x401f8000)     16 KB, Reserved
 *                                 (0x401fc000)     16 KB, Reserved
 *                                 (0x40200000)      1 MB, Reserved
 *                                 (0x40300000)      1 MB, Reserved
 */

/* AIPS-2 Memory Map ********************************************************/

#define IMXRT_SPDIF_BASE           (0x40400000) /*  16 KB, SPDIF */
#define IMXRT_SAI1_BASE            (0x40404000) /*  16 KB, SAI1 */
#define IMXRT_SAI2_BASE            (0x40408000) /*  16 KB, SAI2 */
#define IMXRT_SAI3_BASE            (0x4040c000) /*  16 KB, SAI3 */

                                /* (0x40410000)     16 KB, Reserved */

