apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_memorymap.h
#define IMXRT_ASRC_BASE            (0x40414000) /*  16 KB, ASRC */
#define IMXRT_USDHC1_BASE          (0x40418000) /*  16 KB, USDHC1 */
#define IMXRT_USDHC2_BASE          (0x4041c000) /*  16 KB, USDHC2 */
#define IMXRT_ENET_1G_BASE         (0x40420000) /*  16 KB, ENET_1G */
#define IMXRT_ENET_BASE            (0x40424000) /*  16 KB, ENET */

                                /* (0x40428000)     16 KB, Reserved */

#define IMXRT_USBOTG2_BASE         (0x4042c000) /*  16 KB, USBOTG2 */
#define IMXRT_USB_BASE             (0x40430000) /*  16 KB, USBOTG1 */
#define IMXRT_USBPHY1_BASE         (0x40434000) /*  16 KB, USBPHY1 */
#define IMXRT_USBPHY2_BASE         (0x40438000) /*  16 KB, USBPHY2 */
#define IMXRT_ENET_QOS_BASE        (0x4043c000) /*  16 KB, ENET_QOS */

/*                                 (0x40440000)     16 KB, CAAM (General)
 *                                 (0x40444000)     16 KB, CAAM (General)
 *                                 (0x40448000)     16 KB, CAAM (General)
 *                                 (0x4044c000)     16 KB, CAAM (General)
 *                                 (0x40450000)     16 KB, CAAM (JR0)
 *                                 (0x40454000)     16 KB, CAAM (JR0)
 *                                 (0x40458000)     16 KB, CAAM (JR0)
 *                                 (0x4045c000)     16 KB, CAAM (JR0)
 *                                 (0x40460000)     16 KB, CAAM (JR1)
 *                                 (0x40464000)     16 KB, CAAM (JR1)
 *                                 (0x40468000)     16 KB, CAAM (JR1)
 *                                 (0x4046c000)     16 KB, CAAM (JR1)
 *                                 (0x40470000)     16 KB, CAAM (JR2)
 *                                 (0x40474000)     16 KB, CAAM (JR2)
 *                                 (0x40478000)     16 KB, CAAM (JR2)
 *                                 (0x4047c000)     16 KB, CAAM (JR2)
 *                                 (0x40480000)     16 KB, CAAM (JR3)
 *                                 (0x40484000)     16 KB, CAAM (JR3)
 *                                 (0x40488000)     16 KB, CAAM (JR3)
 *                                 (0x4048c000)     16 KB, CAAM (JR3)
 *                                 (0x40490000)     16 KB, CAAM (Reserved)
 *                                 (0x40494000)     16 KB, CAAM (Reserved)
 *                                 (0x40498000)     16 KB, CAAM (Reserved)
 *                                 (0x4049c000)     16 KB, CAAM (Reserved)
 *                                 (0x404a0000)     16 KB, CAAM (RTIC)
 *                                 (0x404a4000)     16 KB, CAAM (RTIC)
 *                                 (0x404a8000)     16 KB, CAAM (RTIC)
 *                                 (0x404ac000)     16 KB, CAAM (RTIC)
 *                                 (0x404b0000)     16 KB, CAAM (Reserved)
 *                                 (0x404b4000)     16 KB, CAAM (Reserved)
 *                                 (0x404b8000)     16 KB, CAAM (Reserved)
 *                                 (0x404bc000)     16 KB, CAAM (Reserved)
 *                                 (0x404c0000)     16 KB, CAAM (Debug)
 *                                 (0x404c4000)     16 KB, CAAM (Debug)
 *                                 (0x404c8000)     16 KB, CAAM (Debug)
 *                                 (0x404cc000)     16 KB, CAAM (Debug)
 *                                 (0x404d0000)    448 KB, CAAM (Reserved)
 *                                 (0x40540000)    768 KB, Reserved
 *                                 (0x40600000)      1 MB, Reserved
 *                                 (0x40700000)      1 MB, Reserved
 */

/* AIPS-3 Memory Map ********************************************************/

#define IMXRT_CSI_BASE             (0x40800000) /*  16 KB, CSI */
#define IMXRT_ELCDIF_BASE          (0x40804000) /*  16 KB, eLCDIF */
#define IMXRT_LCDIFV2_BASE         (0x40808000) /*  16 KB, LCDIFv2 */
#define IMXRT_MIPI_DSI_BASE        (0x4080c000) /*  16 KB, MIPI_DSI */
#define IMXRT_MIPI_CSI_BASE        (0x40810000) /*  16 KB, MIPI_CSI */
#define IMXRT_PXP_BASE             (0x40814000) /*  16 KB, PXP */
#define IMXRT_VIDEO_MUX_BASE       (0x40818000) /*  16 KB, VIDEO_MUX */

/*                                 (0x4081c000)     16 KB, Reserved
 *                                 (0x40a00000)      1 MB, Reserved
 *                                 (0x40b00000)      1 MB, Reserved
 */

/* AIPS-4 Memory Map ********************************************************/

#define IMXRT_GPC_BASE             (0x40c00000) /*  16 KB, GPC */
#define IMXRT_SRC_BASE             (0x40c04000) /*  16 KB, SRC */
#define IMXRT_IOMUXCLPSR_BASE      (0x40c08000) /*  16 KB, IOMUXC_LPSR */
#define IMXRT_IOMUXCLPSRGPR_BASE   (0x40c0c000) /*  16 KB, IOMUXC_LPSR_GPR */
#define IMXRT_WDOG4_BASE           (0x40c10000) /*  16 KB, WDOG4 */
#define IMXRT_EDMA_LPSR_BASE       (0x40c14000) /*  16 KB, EDMA_LPSR */
#define IMXRT_DMAMUX1_BASE         (0x40c18000) /*  16 KB, DMAMUX1 (LPSR) */

                                /* (0x40c1c000)     16 KB, Reserved */

#define IMXRT_PDM_BASE             (0x40c20000) /*  16 KB, PDM */
#define IMXRT_LPUART11_BASE        (0x40c24000) /*  16 KB, LPUART11 */
#define IMXRT_LPUART12_BASE        (0x40c28000) /*  16 KB, LPUART12 */
#define IMXRT_LPSPI5_BASE          (0x40c2c000) /*  16 KB, LPSPI5 */
#define IMXRT_LPSPI6_BASE          (0x40c30000) /*  16 KB, LPSPI6 */
#define IMXRT_LPI2C5_BASE          (0x40c34000) /*  16 KB, LPI2C5 */
#define IMXRT_LPI2C6_BASE          (0x40c38000) /*  16 KB, LPI2C6 */
#define IMXRT_CAN3                 (0x40c3c000) /*  16 KB, CAN3 */
#define IMXRT_SAI4                 (0x40c40000) /*  16 KB, SAI4 */
#define IMXRT_RDC_SEMAPHORE1_BASE  (0x40c44000) /*  16 KB, RDC_SEMAPHORE1 */
#define IMXRT_MU_A                 (0x40c48000) /*  16 KB, MU-A */
#define IMXRT_MU_B                 (0x40c4c000) /*  16 KB, MU-B */

/*                                 (0x40c50000)     16 KB, Reserved
 *                                 (0x40c54000)     16 KB, Reserved
 *                                 (0x40c58000)     16 KB, Reserved
 */

#define IMXRT_GPIO7_BASE           (0x40c5c000) /*  16 KB, GPIO7 */
#define IMXRT_GPIO8_BASE           (0x40c60000) /*  16 KB, GPIO8 */
#define IMXRT_GPIO9_BASE           (0x40c64000) /*  16 KB, GPIO9 */
#define IMXRT_GPIO10_BASE          (0x40c68000) /*  16 KB, GPIO10 */
#define IMXRT_GPIO11_BASE          (0x40c6c000) /*  16 KB, GPIO11 */
#define IMXRT_GPIO12_BASE          (0x40c70000) /*  16 KB, GPIO12 */

                                /* (0x40c74000)     16 KB, Reserved */

