apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_memorymap.h
#define IMXRT_RDC_BASE             (0x40c78000) /*  16 KB, RDC */

                                /* (0x40c7c000)     16 KB, Reserved */

#define IMXRT_KEYMGR_BASE          (0x40c80000) /*  16 KB, KEYMGR */
#define IMXRT_ANADIG_BASE          (0x40c84000) /*  16 KB, ANALOG / ANADIG */
#define IMXRT_PGMC_BASE            (0x40c88000) /*  16 KB, PGMC */

                                /* (0x40c8c000)     16 KB, Reserved */

#define IMXRT_SNVSHP_BASE          (0x40c90000) /*  16 KB, SNVS */
#define IMXRT_IOMUXCSNVS_BASE      (0x40c94000) /*  16 KB, IOMUXC_SNVS */
#define IMXRT_IOMUXCSNVSGPR_BASE   (0x40c98000) /*  16 KB, IOMUXC_SNVS_GPR */
#define IMXRT_SNVS_SRAM_BASE       (0x40c9c000) /*  16 KB, SNVS_SRAM */
#define IMXRT_GPIO13_BASE          (0x40ca0000) /*  16 KB, GPIO13 */
#define IMXRT_ROMCP_BASE           (0x40ca4000) /*  16 KB, ROMCP */
#define IMXRT_DCDC_BASE            (0x40ca8000) /*  16 KB, DCDC */
#define IMXRT_OCOTP_BASE           (0x40cac000) /*  16 KB, OCOTP */
#define IMXRT_PIT2_BASE            (0x40cb0000) /*  16 KB, PIT2 */
#define IMXRT_SSARC_HP_BASE        (0x40cb4000) /*  16 KB, SSARC_HP (SRAM) */
#define IMXRT_SSARC_LP_BASE        (0x40cb8000) /*  16 KB, SSARC_LP */

                                /* (0x40cbc000)     16 KB, Reserved */

#define IMXRT_CCM_BASE             (0x40cc0000) /*  32 KB, CCM */
#define IMXRT_SEMA4_BASE           (0x40cc8000) /*  16 KB, SEMA4 */
#define IMXRT_RDC_SEMAPHORE2_BASE  (0x40ccc000) /*  16 KB, RDC_SEMAPHORE2 */

/*                                 (0x40cd0000)     16 KB, XRDC2 MGR M4
 *                                 (0x40cd4000)     16 KB, XRDC2 MGR M4
 *                                 (0x40cd8000)     16 KB, XRDC2 MGR M4
 *                                 (0x40cdc000)     16 KB, XRDC2 MGR M4
 *                                 (0x40ce0000)     16 KB, XRDC2 MGR M7
 *                                 (0x40ce4000)     16 KB, XRDC2 MGR M7
 *                                 (0x40ce8000)     16 KB, XRDC2 MGR M7
 *                                 (0x40cec000)     16 KB, XRDC2 MGR M7
 *                                 (0x40cf0000)   1088 KB, Reserved
 *                                 (0x40e00000)      1 MB, Reserved
 *                                 (0x40f00000)      1 MB, Reserved
 */

/* AIPS M7 Memory Map *******************************************************/

                                /* (0x42000000)     32 KB, Reserved */

#define IMXRT_CM7_GPIO2_BASE       (0x42008000) /*  16 KB, CM7_GPIO2 */
#define IMXRT_CM7_GPIO3_BASE       (0x4200c000) /*  16 KB, CM7_GPIO3 */

                                /* (0x42010000)    960 KB, Reserved */

/* PPB Memory Map ***********************************************************/

/*                                 (0xe0000000)    256 KB, M7/M4 Internal Use
 *                                 (0xe0040000)      4 KB, PPB Reserved
 */

#define IMXRT_ETM_BASE             (0xe0041000) /*   4 KB, ETM */
#define IMXRT_CTI_BASE             (0xe0042000) /*   4 KB, CTI */
#define IMXRT_ATB_BASE             (0xe0043000) /*   4 KB, ATB Funnel */
#define IMXRT_CSSYS_CTI_BASE       (0xe0044000) /*   4 KB, CSSYS CTI */
#define IMXRT_CSSYS_ATB_BASE       (0xe0045000) /*   4 KB, CSSYS ATB Funnel */
#define IMXRT_CSSYS_TPIU_BASE      (0xe0046000) /*   4 KB, CSSYS TPIU */
#define IMXRT_CSSYS_TSGEN_BASE     (0xe0047000) /*   4 KB, CSSYS TSGEN */
#define IMXRT_CSSYS_SWO_BASE       (0xe0048000) /*   4 KB, CSSYS SWO */

                                /* (0xe0049000)    220 KB, PPB Reserved */

#define IMXRT_MCM_BASE             (0xe0080000) /*   4 KB, MCM */
#define IMXRT_MMCAU_BASE           (0xe0081000) /*   4 KB, M4: MMCAU */
#define IMXRT_AHB_LMEM_BASE        (0xe0082000) /*   4 KB, M4: AHB_LMEM */

                                /* (0xe0083000)    488 KB, PPB Reserved */

#define IMXRT_SYSROM_BASE          (0xe00fd000) /*   4 KB, SYS ROM */
#define IMXRT_PROCROM_BASE         (0xe00fe000) /*   4 KB, Processor ROM */
#define IMXRT_PPBROM_BASE          (0xe00ff000) /*   4 KB, PPB */

#endif /* __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_MEMORYMAP_H */
